Requests_control/src/Reports/Обращения/Обращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Обращения</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

Requests_control/src/Catalogs/Обращения/Обращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Обращения</name>
  <attributes>
    <name>ВидОбращения</name>
    <type>
      <types>CatalogRef.ВидыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеВопросыНаРассмотрении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоОбращению</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Заявители</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ОрганыИУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбратившихся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРассмотрения</name>
    <comment>Плановый срок рассмотрения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокРассмотренияПервоначальный</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.Вопросы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтвета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящаяДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящийНомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОМерах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОРезультатах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганДляПередачи</name>
      <type>
        <types>CatalogRef.ОрганыИУчреждения</types>
      </type>
    </attributes>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатРассмотрения</name>
      <type>
        <types>EnumRef.РезультатыРассмотрения</types>
      </type>
    </attributes>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.Темы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тематика</name>
      <type>
        <types>CatalogRef.Тематики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Requests_control/src/Reports/Обращения/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура КодВопросаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Раздел", Неопределено);
	ПараметрыФормы.Вставить("Тематика", Неопределено);
	ПараметрыФормы.Вставить("Тема", Неопределено);
	ПараметрыФормы.Вставить("Вопрос", Неопределено);
	ПараметрыФормы.Вставить("КодВопроса", КодВопроса);
	
	ПараметрыФормы.Вставить("РезультатРассмотрения", Неопределено);
	ПараметрыФормы.Вставить("ДатаОтвета", Неопределено);
	ПараметрыФормы.Вставить("ОрганДляПередачи", Неопределено);
	ПараметрыФормы.Вставить("ИсходящаяДатаДокумента", Неопределено);
	ПараметрыФормы.Вставить("ИсходящийНомерДокумента", Неопределено);
	ПараметрыФормы.Вставить("КлючСохраненияПоложенияОкна", "ВыборНесколькихВопросов");
	
	ПараметрыФормы.Вставить("МнениеАвтораОРезультатах", Неопределено);
	ПараметрыФормы.Вставить("МнениеАвтораОМерах", Неопределено);
	
	ПараметрыФормы.Вставить("СокращенныйРежим", Истина);
	
	Обработчик = Новый ОписаниеОповещения("КодыВопросовПослеВыбора", 
		ЭтотОбъект);
	ОткрытьФорму("Справочник.Обращения.Форма.ФормаВыбораИзКлассификатора", ПараметрыФормы,,,,,
		Обработчик, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура КодыВопросовПослеВыбора(Результат, Параметры) Экспорт 
	
	Если Результат <> Неопределено Тогда 
		КодВопроса = Результат.КодВопроса;
		КодВопросаПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодВопросаПриИзменении(Элемент)

 	ПараметрКодВопроса = Новый ПараметрКомпоновкиДанных("КодВопроса"); 
	
	Для Каждого ЭлементНастроек Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		
		Если (ТипЗнч(ЭлементНастроек) =  Тип("ЗначениеПараметраНастроекКомпоновкиДанных"))
		   И (ЭлементНастроек.Параметр = ПараметрКодВопроса) Тогда
		   
			ЭлементНастроек.Значение = КодВопроса;
			ЭлементНастроек.Использование = ЗначениеЗаполнено(КодВопроса);
			
		КонецЕсли;	
		
 	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	
	Элементы.КодВопроса.Видимость = Истина;
	
	ПараметрКодВопроса = Новый ПараметрКомпоновкиДанных("КодВопроса"); 
	
	Для Каждого ЭлементНастроек Из Настройки.ПараметрыДанных.Элементы Цикл
		
		Если (ТипЗнч(ЭлементНастроек) =  Тип("ЗначениеПараметраНастроекКомпоновкиДанных"))
		   И (ЭлементНастроек.Параметр = ПараметрКодВопроса)
		   И ЭлементНастроек.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		   
			Элементы.КодВопроса.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
